*** 1.1. IPv4套接字地址结构
#+BEGIN_SRC C
struct in_addr{
        in_addr_t       s_addr;
};

struct sockaddr_in{
        uint8_t         sin_len;
        sa_family_t     sin_family;
        in_port_t       sin_port;
        struct in_addr  sin_addr;
        char            sin_zero[8];
};
#+END_SRC

#+RESULTS:

通常只使用三个字段： =sin_family= , =sin_addr= 和 =in_port=

#+BEGIN_SRC C
bzero( &servaddr, sizeof( servaddr ) );
servaddr.sin_family = AF_INET;
servaddr.sin_addr.s_addr = htonl(INADDR_ANY);
servaddr.sin_port = htons(7777);
#+END_SRC

example01:
#+BEGIN_SRC C
#include <stdio.h>
#include <sys/stat.h>
#include <netinet/in.h>

int main( void )
{
        printf("%d\n", htonl(INADDR_ANY));
        printf("%d\n", htonl(16));
        printf("%d\n", htons(13));
        return 0;
}
#+END_SRC

#+RESULTS:
|         0 |
| 268435456 |
|      3328 |
*** 3.2. 主机字节序和网络字节序之间的相互转换的四个函数
#+BEGIN_SRC C
#include <netinet/in.h>

uint16_t htons( uint16_t host16bitvalue );
uint32_t htonl( uint32_t host32bitvalue );
                         // ------------均返回：网络字节序的值
uint16_t ntohs( uint16_t net16bitvalue );
uint32_t ntohl( uint32_t net32bitvalue );
                         // ------------均返回：主机字节序的值
#+END_SRC

#+BEGIN_QUOTE
在这些名字中，h代表host，n代表network，s代表short，l代表long。如今我们应该把s视为16位的值（如TCP或UDP端口号），把l视为一个32位的值（例如IPv4地址）
#+END_QUOTE

sample02:
#+BEGIN_SRC C
  #include <stdio.h>
  #include <netinet/in.h>
  #include <sys/socket.h>

  int main(int argc, char **argv)
  {
      uint32_t	ipAddr;
      uint16_t	portAddr;
      struct sockaddr_in	servaddr;
      char		buff[1024];

      bzero(&servaddr, sizeof(servaddr));

      inet_pton(AF_INET, "127.0.0.1", &servaddr.sin_addr);
      ipAddr = ntohl(servaddr.sin_addr.s_addr);
      printf("ipAddr is:%d\n", ipAddr);
      bzero(&servaddr, sizeof(servaddr));
      servaddr.sin_addr.s_addr = htonl(ipAddr);
      inet_ntop(AF_INET, &servaddr.sin_addr, buff, sizeof(buff));
      printf("the ip addr is:%s\n", buff);
      printf("------------\n");

      portAddr = htons(9877);
      printf("the port 9877 netword port is:%d\n", portAddr);
      printf("the port is:%d\n", ntohs(portAddr));

      return 0;
  }
#+END_SRC

#+RESULTS:
| ipAddr       | is:2130706433 |         |              |      |          |
| the          | ip            | addr    | is:127.0.0.1 |      |          |
| ------------ |               |         |              |      |          |
| the          | port          | 9877    | netword      | port | is:38182 |
| the          | port          | is:9877 |              |      |          |
*** 4.1. =inet_aton= 和 =inet_ntoa=
#+BEGIN_SRC C
#include <arpa/inet.h>

int inet_aton( const char *strptr, struct in_addr *addrptr );
                 // 返回：若字符串有效则为1，否则为0
char *inet_ntoa( struct in_addr inaddr );
                 // 返回：指向一个点分十进制数串的指针
#+END_SRC

sample03:
#+BEGIN_SRC C
#include <stdio.h>
#include <arpa/inet.h>

int main( int argc, char **argv )
{
    struct in_addr  addr;
    char    *pAddr;
    inet_aton( "127.0.0.1", &addr );
    printf( "%d\n", addr );
    pAddr = inet_ntoa( addr );
    printf("%s\n", pAddr );

    return 0;
}
#+END_SRC

#+RESULTS:
|  16777343 |
| 127.0.0.1 |
